const ChineseAgreements = (props) => {
  let style = {
    border: '1px solid #ccc',
    padding: '2px 4px'
  }
  return (
    <div className="protocol">
      <h2>Ezbuy商家入驻协议</h2>
      <h5 style={{textAlign: 'right', fontWeight: 'normal', 'color': '#ccc'}}>（本协议的效力期限为2017年2月28日起至2018年2月28日止）</h5>
      <div className="paragraph">
        <h2>一、入驻规则</h2>
        <p>
            1.Ezbuy暂未授权任何机构进行代理招商服务，入驻申请流程及相关的收费说明均以本官方合作规则为准。<br/>
            2.Ezbuy有权根据包括但不限于品牌需求、公司合规状况、公司经营状况、服务水平等其他因素退回入驻商家的入驻申请；同时ezbuy有权在申请入驻及后续经营阶段要求入驻商家提供其他资质、证照或证明文件；<br/>
            3.入驻商家必须如实提供资料和信息。<br/>
            <div className="tab">
              A．入驻商家有义务向ezbuy提供真实、完整、全面的资料和信息，并对其所提供的一切资料和信息承担法律责任。若商家提供的相关资质、证照或证明文件为第三方享有权利的文件或第三方授权文件，包括但不限于第三方的商标注册证、授权书等，商家有义务先行核实第三方文件的真实有效性，并对上传至ezbuy的此类材料承担法律责任。如商家提供的资料或信息有任何虚假、隐瞒或误导的，将被ezbuy列入非诚信商家名单，ezbuy有权单方解除与您的入驻合作；如因商家提供的资料或信息有任何虚假、隐瞒或误导而导致ezbuy任何损失的（包括但不限于被认定为侵权而需进行赔偿、罚款和ezbuy为维护权利进行的诉讼、聘请律师、公证费用等），由商家向ezbuy全额赔偿。关于入驻商家根据售卖商品而需提供的实际信息规则，参见《ezbuy商家商品信息提供准则》。<br/>
              B．商家应如实提供其店铺运营的主体及相关信息，包括但不限于代理运营商、实际店铺经营主体、实际控制人身份证照、联系地址和电话等信息；<br/>
              C．Ezbuy关于商家信息和资料变更有相关规定的从其规定，但商家如变更B款所列信息，应（提前十五个工作日）书面告知ezbuy，请将变更信息的请求与材料发送至cbusinessdevelopment@ezbuy.com；前述信息如有任何变更，商家有义务在变更发生后三日内向ezbuy提供变更的证明材料和变更后的资料。<br/>
            </div>
            4.Ezbuy同时接受个人、个体工商户及企业的入驻申请（ezbuy员工及员工直系亲属不可在平台入驻）；对于违反入驻规则完成的入驻申请，ezbuy保留处罚该入驻商家的权利。<br/>
            5.Ezbuy是基于为中国海外客户服务而存在的跨境电商平台，入驻商家与ezbuy之间的法律关系并不能影响ezbuy享有对于显示于其网站的商品销售价格的最终定价权（包括但不限于以下域名：https://ezbuy.sg/；https://ezbuy.my/；https://ezbuy.co.th/；http://id.ezbuy.com/）。入驻商家对于销售的商品的定价可以对ezbuy提出建议。同时，为防止入驻商家售卖的商品可能存在质量和/或知识产权侵权问题（包括但不限于商标权、专利权、著作权），ezbuy将实行保证金规则，入驻商家需下载《ezbuy入驻商家保证金规则》以知悉售卖商品的保证金数额。<br/>
            6.入驻商家需要与由ezbuy指定的运营人员（ezbuy卖家运营专员）沟通，未经ezbuy官方认可的运营人员或沟通渠道而私下约定的事项ezbuy不予认可，所造成的损失由入驻商家自行承担。<br/>
        </p>
      </div>
      <div className="paragraph">
        <h2> 二、商品规则 </h2>
        <p>
          1.入驻商家出售的商品须与其在ezbuy上登载的商品链接的描述相符（包括但不限于颜色、样式、尺码、商标、重量等所有相关商品属性）；<br/>
          2.入驻商家出售的商品重量必须填写准确，因重量填写不准确问题导致的国际运费的增加由商家负担；<br/>
          3.入驻商家出售的商品库存数量必须填写真实准确；<br/>
          4.入驻商家如果出售品牌产品或带有知识产权（包括但不限于商标权、专利权、著作权）的商品，则有义务在ezbuy上登载商品链接前，向ezbuy上传质检报告和品牌授权书、知识产权证明等文件；如因买家于ezbuy平台购买的入驻商家商品被认定为存在任何侵权情况（包括但不限于ezbuy因此被中国、买家所在国或其他外国法院；被知识产权权利人在任何国家认定为销售侵权商品而构成侵权等情况），而导致ezbuy任何损失的（包括但不限于被认定为侵权而需进行赔偿、罚款和ezbuy为维护权利进行的诉讼、聘请律师、公证费用等），由商家向ezbuy全额赔偿。<br/>
          5.入驻商家在上传商品详情页时不能含有站外链接、二维码等其他网站相关信息；<br/>
入驻商家需下载<span style={{color: '#f00'}}>《ezbuy分类目商品发布规则》</span>并详细查看，该表中商品部分实行数量限制，部分商品未经允许不得上架。
          6.不符合商品规则的商品，ezbuy无需通知商家即有权进行下架清理，由此产生的任何责任由商家自行承担。<br/>
          7.入驻商家售卖敏感品必须如实标注（敏感品的范围参见ezbuy的发布的《ezbuy敏感品名录列表》）。如果入驻商家不清楚售卖商品是否属于敏感品，则必须提前咨询指定的客服人员或运营人员，否则因敏感品未如实标注而产生的损失（包括给ezbuy造成的损失），全部由入驻商家独自承担。<br/>
          8.Ezbuy的运营人员享有对于疑似价格虚高或是假冒伪劣商品主动下架的权利，入驻商家如果对于此操作有异议，则需要提供相关的证明（如进货清单或材质说明）于相应的运营人员，最终解释权由ezbuy保留。<br/>
          9.Ezbuy的运营人员享有对在约定时间内未按照ezbuy的要求进行修改的问题商品主动下架的权利，此操作造成的损失由入驻商家独自承担。<br/>
        </p>
      </div>
      <div className="paragraph">
        <h2> 三、发货规则 </h2>
        <p>
          1.入驻商家必须在订单生成后的24小时内进行打包、操作发货（但ezbuy保留在特定日期改变发货时间的权利），并正确填写物流单号（要求可以查询该单号的物流揽件信息）；并在包裹内附上发货清单。关于发货规则，入驻商家需下载《ezbuy入驻商家发货规则》以知悉相关的发货要求。<br/>
          2.严禁虚假发货，如果入驻商家如果在订单生成后48小时内或是发货倒计时结束，入驻商家没有发货（或是无法查询该单号的物流揽件信息），ezbuy将自动单方面取消该订单在而无需提前通知商家。<br/>
          3.如果入驻商家在一个月内出现三次违规操作，ezbuy将给予该商家相应的警告或惩处，且由于违规操作导致造成ezbuy的一切损失（包括但不限于：取消订单，未正确粘贴订单号导致仓库无法匹配入库，预期到达日期罚款（即ETA罚款）等），由该入驻商家全部承担。<br/>
          4.入驻商家必须在物流揽件后24小时内及时更新物流信息，如果因入驻商家未及时更新物流而造成的相应损失，由入驻商家单独承担。<br/>
        </p>
      </div>
      <div className="paragraph">
        <h2> 四、售后规则 </h2>
        <p>
          1.因ezbuy网站的用户为国外买家（包括但不限于泰国、马来西亚、印度尼西亚、新加坡等国），故买家申请售后的时限为订单成交后30天内；<br/>
          2.买家如果发起售后申请，ezbuy平台客服有权介入并与入驻商家进行沟通、协调处理，入驻商家有义务积极配合；<br/>
          3.买家如果发起售后申请，ezbuy平台客服将通过商家注册时预留的联系方式，在24小时内2次联系商家，如果均未得到有效回复，商家在此同意ezbuy无需进行提前通知即有权操作退还全部或部分货款给买家；对此退款或退货导致的物流费用、手续费与其他的相关费用由商家自行承担；<br/>
          4.买家如果选择退货，退货原因是入驻商家因素导致的（包括但不仅限于商品质量或数量瑕疵、实物与网页描述不符、发货错误、知识产权侵权等），来回物流费用（即发货和退货的物流费用）与其他相关费用应由入驻商家承担。<br/>
          5.其他的售后规则，入驻商家需下载《ezbuy入驻商家售货规则》以知悉相关的售后要求。<br/>
        </p>
      </div>
      <div className="paragraph">
        <h2> 五、结算原则以及收费标准 </h2>
        <p>
          1.入驻商家的销量统计以ezbuy后台统计数据为准；<br/>
          2.Ezbuy向入驻商家收取一定金额的大客户折扣费。大客户折扣费按照商家产品成交金额的百分比收取（后期将根据各类目实际情况调整大客户折扣费的收取算法）<br/>
          <table style={{borderCollapse: 'collapse', display: 'none'}}>
            <tr>
              <th style={style}> 类目 </th>
              <th style={style}> 折扣费 </th>
            </tr>
            <tr>
              <td style={style}>Women's Clothing</td>
              <td style={style}>10%</td>
            </tr>
            <tr>
              <td style={style}>Shoes, Bags & Accessories</td>
              <td style={style}>5%</td>
            </tr>
            <tr>
              <td style={style}>Toys, Mother & Kids</td>
              <td style={style}>5%</td>
            </tr>
            <tr>
              <td style={style}>Mobiles & Tablets</td>
              <td style={style}>5%</td>
            </tr>
            <tr>
              <td style={style}>Sports & Outdoors</td>
              <td style={style}>5%</td>
            </tr>
            <tr>
              <td style={style}>Office & Stationery</td>
              <td style={style}>5%</td>
            </tr>
            <tr>
              <td style={style}>Beauty & Health</td>
              <td style={style}>5%</td>
            </tr>
            <tr>
              <td style={style}>Men's Clothing</td>
              <td style={style}>5%</td>
            </tr>
            <tr>
              <td style={style}>Automotives</td>
              <td style={style}>5%</td>
            </tr>
            <tr>
              <td style={style}>Home & Garden</td>
              <td style={style}>10%</td>
            </tr>
          </table>
          3.买家确认收货、确认收货期限已到系统自动确认收货或平台客服操作确认收货之日为订单完成日。ezbuy的 大客户折扣费与商家货款，在商家订单完成日后的次月第5个工作日内结算，如果订单有平台客服介入进行售后处理或维权处理，则ezbuy有权暂时冻结商家账户中等额于该笔交易货款的金额，并按实际处理后的情况于平台客服处理完成后的次月第5个工作日内结算；<br/>
          4.入驻商家的结算金额=订单成交金额-退款订单的金额-大客户折扣费；<br/>
          5.入驻商家可在平台的卖家中心查询详细账单。<br/>
          6.入驻商家变更结算信息的程序：入驻商家如果需要变更结算信息，则需要提供以下文件于ezbuy：<br/>
          <div className="tab">
            1)结算信息变更之前的对应的银行卡复印件，开户人身份证复印件/公司营业执照复印件，所有的复印件需要申请人签字或盖章；<br/>
            2)结算信息变更之后对应的银行卡复印件，开户人身份证复印件/公司营业执照复印件，所有的复印件需要申请人签字或盖章；<br/>
            3)提交更改信息申请表，该表需要入驻商家与ezbuy共同签字或盖章。<br/>
          </div>
        </p>
      </div>
      <div className="paragraph">
        <h2> 六、清退原则 </h2>
        <p>
          对满足清退条件的入驻商家，ezbuy有权单方决定将其清退。入驻商家满足以下任一条款即被视为满足清退条件：<br/>
          1.连续三个月在ezbuy平台的打分系统评分中低于3分（该评分为商家配合度、活动参与度、销售额、发货时效性、退单率、商品详情合格率等综合加权评分，关于该打分系统的规则，参见《ezbuy入驻商家评分准则》）；<br/>
          2.如果入驻商家连续出现配合度低、问题屡教不改、严重诚信等问题 （例如不采用ezbuy要求发货方式发货、未及时按约定时间完成不合规商品整改的、报名参加活动之后又临时以各种理由不参加等情况）；<br/>
          3.恶意利用ezbuy各种形式的漏洞（包括带不限于代码漏洞与活动漏洞），对ezbuy平台以及其他卖家造成名誉或者经济损失和/或情节严重的；<br/>
          4.其他ezbuy认为不符合平台品牌需求、买家市场需求、公司合规状况、公司经营状况、高质量服务水平等的情况。<br/>
          <br/>
          Ezbuy对商家运营提出的整改建议，商家应在不超过3个工作日内整改解决（特殊情况经ezbuy同意后可以另行安排）。Ezbuy有权采取对清退商家下架其所有在售商品，锁定上架或者编辑其商品的功能等限制措施，商家的未发货订单必须在48小时内发货，否则ezbuy有权单方取消该订单。被ezbuy采取清退措施的商家未结账款，仍按照本协议约定的流程、账期进行货款结算，所有账款结清之后关闭账户。因清退产生的一切责任由商家自行承担。清退的最终解释权（包括但不限于清退条件、流程、锁定功能等 ）归ezbuy所有。
        </p>
      </div>
      <div className="paragraph">
        <h2> 七、协议效力及违约 </h2>
        <p>
          1.本协议由【ezbuyHK】（本协议中Ezbuy, ezbuy均代指 EZBUY HONGKONG HOLDINGS LIMITED）与入驻ezbuy网站平台的商家签订，适用于所有入驻ezbuy网站平台的商家，商家任何时候在ezbuy平台上的经营活动均受本协议及其修订版的约束。本协议对双方均发生法律效力。ezbuy将结合各行业发展动态、国家相关规定、消费者购买需求及法律法规的变更等，不定期的更新招商和入驻规则（同时包括但不限于本协议及其分项规则）。发生任何如前所述的变更，ezbuy将在合理期间内以公示（包括但不限于入驻商家论坛或是商家管理渠道系统等）的方式进行公告，不再单独通知入驻商家，商家同时有责任浏览相关信息并知悉所有相关的变更。变更后的规则经公示后生效。如果入驻商家不同意相关规则的变更，应当立即停止ezbuy的任何服务并通知ezbuy，否则将默认视为同意相关规则的变更。<br/>
          2.合作过程中商家违反以上规则的任何约定，ezbuy有权单方解除本入驻协议，解除入驻合作。<br/>
          3.本协议的生效、解释、执行、管辖、争议的解决均适用中华人民共和国法律（为避免歧义，不包括中国香港、台湾法律）；<br/>
          <span style={{background: '#ff0'}}>4.本协议的合同履行地为上海市浦东新区。本协议引起的或与本协议有关的任何争议，双方均可向上海市浦东新区人民法院提起诉讼。</span><br/>
        </p>
      </div>
    </div>
  )
}

export default ChineseAgreements
